testing/artillery/result_cluster.txt
Phase started: unnamed (index: 0, duration: 1s) 13:42:49(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 13:42:50(-0300)

--------------------------------------
Metrics for period to: 13:42:50(-0300) (width: 0.782s)
--------------------------------------

http.codes.200: ................................................................ 1039
http.request_rate: ............................................................. 1063/sec
http.requests: ................................................................. 1063
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 22
  median: ...................................................................... 10.1
  p95: ......................................................................... 16.9
  p99: ......................................................................... 19.1
http.responses: ................................................................ 1039
vusers.completed: .............................................................. 16
vusers.created: ................................................................ 40
vusers.created_by_name.0: ...................................................... 40
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 179.7
  max: ......................................................................... 474.9
  median: ...................................................................... 340.4
  p95: ......................................................................... 459.5
  p99: ......................................................................... 459.5


--------------------------------------
Metrics for period to: 13:43:00(-0300) (width: 0.568s)
--------------------------------------

http.codes.200: ................................................................ 961
http.request_rate: ............................................................. 937/sec
http.requests: ................................................................. 937
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 30
  median: ...................................................................... 13.1
  p95: ......................................................................... 23.8
  p99: ......................................................................... 25.8
http.responses: ................................................................ 961
vusers.completed: .............................................................. 34
vusers.created: ................................................................ 10
vusers.created_by_name.0: ...................................................... 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 372.9
  max: ......................................................................... 621.5
  median: ...................................................................... 561.2
  p95: ......................................................................... 620.3
  p99: ......................................................................... 620.3


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 13:42:52(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 1000/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 30
  median: ...................................................................... 10.9
  p95: ......................................................................... 19.9
  p99: ......................................................................... 24.8
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 179.7
  max: ......................................................................... 621.5
  median: ...................................................................... 487.9
  p95: ......................................................................... 620.3
  p99: ......................................................................... 620.3