testing/artillery/result_fork.txt
Phase started: unnamed (index: 0, duration: 1s) 13:31:38(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 13:31:39(-0300)

--------------------------------------
Metrics for period to: 13:31:40(-0300) (width: 1.762s)
--------------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 1142/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 46
  median: ...................................................................... 23.8
  p95: ......................................................................... 36.2
  p99: ......................................................................... 39.3
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 381.7
  max: ......................................................................... 1111.6
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1107.9
  p99: ......................................................................... 1107.9


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 13:31:41(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 1142/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 46
  median: ...................................................................... 23.8
  p95: ......................................................................... 36.2
  p99: ......................................................................... 39.3
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 381.7
  max: ......................................................................... 1111.6
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1107.9
  p99: ......................................................................... 1107.9